In [1]:
%matplotlib inline
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.metrics import mean_squared_error

In [105]:
df_train = pd.read_csv("./train.tsv",sep="\t")
df_test = pd.read_csv("./test.tsv",sep="\t")
df_result = pd.read_csv("./sample_submit.csv",sep="\t",header=None)
display(df_train.head())
display(df_test.head())
display(df_result.head())

,Unnamed: 0,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,0,39.4,4,85.0,70,2070,18.6,78,3,datsun b210 gx
1,3,18.0,6,171.0,97,2984,14.5,75,1,ford pinto
2,9,32.7,6,168.0,132,2910,11.4,80,3,datsun 280-zx
3,11,38.1,4,89.0,60,1968,18.8,80,3,toyota corolla tercel
4,13,28.0,4,98.0,80,2164,15.0,72,1,dodge colt (sw)

,Unnamed: 0,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,1,8,350.0,180,4499,12.5,73,1,oldsmobile vista cruiser
1,2,4,156.0,105,2745,16.7,78,1,plymouth sapporo
2,4,6,156.0,108,2930,15.5,76,3,toyota mark ii
3,5,4,108.0,70,2245,16.9,82,3,toyota corolla
4,6,4,105.0,63,2125,14.7,82,1,plymouth horizon miser

      0
0  1,11
1  2,25
2  4,24
3  5,33
4  6,32

In [7]:
df_train.shape

(199, 10)

In [9]:
df_test.shape

(199, 9)

In [11]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 199 entries, 0 to 198
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    199 non-null    int64
 1   mpg           199 non-null    float64
 2   cylinders     199 non-null    int64
 3   displacement  199 non-null    float64
 4   horsepower    199 non-null    object
 5   weight        199 non-null    int64
 6   acceleration  199 non-null    float64
 7   model year    199 non-null    int64
 8   origin        199 non-null    int64
 9   car name      199 non-null    object
dtypes: float64(3), int64(5), object(2)
memory usage: 15.7+ KB

In [23]:
df_train[["horsepower"]].dtypes

horsepower    object
dtype: object

In [61]:
# 数値ではない型の要素の抽出
df_train[df_train["horsepower"].apply(lambda s:pd.to_numeric(s, errors='coerce')).isnull()]

,Unnamed: 0,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
25,50,40.9,4,85.0,?,1835,17.3,80,2,renault lecar deluxe
80,166,34.5,4,100.0,?,2320,15.8,81,2,renault 18i
176,351,23.6,4,140.0,?,2905,14.3,80,1,ford mustang cobra

In [77]:
df_train_wk = df_train.drop([25,80,176])
df_train_wk.shape
df_train_wk["horsepower"] = df_train_wk["horsepower"].astype("float64")
df_train_wk.dtypes

Unnamed: 0        int64
mpg             float64
cylinders         int64
displacement    float64
horsepower      float64
weight            int64
acceleration    float64
model year        int64
origin            int64
car name         object
dtype: object

In [81]:
hp_mean = df_train_wk["horsepower"].mean()
print(hp_mean)

107.25

In [93]:
df_train[df_train["horsepower"].apply(lambda s:pd.to_numeric(s, errors='coerce')).isnull()]

,Unnamed: 0,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
25,50,40.9,4,85.0,?,1835,17.3,80,2,renault lecar deluxe
80,166,34.5,4,100.0,?,2320,15.8,81,2,renault 18i
176,351,23.6,4,140.0,?,2905,14.3,80,1,ford mustang cobra

In [99]:
df_train[df_train["horsepower"].apply(lambda s:pd.to_numeric(s, errors='coerce')).isnull()].loc[:,"horsepower"]

25     ?
80     ?
176    ?
Name: horsepower, dtype: object

In [107]:
df_train["horsepower"] = pd.to_numeric(df_train["horsepower"],errors='coerce')
print(df_train['horsepower'].isnull().sum())

3

In [109]:
df_train["horsepower"].fillna(hp_mean)
df_train["horsepower"]=df_train["horsepower"].astype("float64")
print(df_train.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 199 entries, 0 to 198
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    199 non-null    int64
 1   mpg           199 non-null    float64
 2   cylinders     199 non-null    int64
 3   displacement  199 non-null    float64
 4   horsepower    196 non-null    float64
 5   weight        199 non-null    int64
 6   acceleration  199 non-null    float64
 7   model year    199 non-null    int64
 8   origin        199 non-null    int64
 9   car name      199 non-null    object
dtypes: float64(4), int64(5), object(1)
memory usage: 15.7+ KB
None